04_Simulation/1.FROZEN/SST_MediumBody_with.inlet.dat.profile.interpolated_GEP_Tr.R.BFS.region.a5.k_froz_omega_froz_no-limiters_/constant/RASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RASModel;

    RASModel             kOmegaSSTGEP_Rijhat_added;

    turbulence          on;

    printCoeffs         on;

    kOmegaSSTGEP_Rijhat_addedCoeffs
    {
        model        Tr.R.BFS.region.a5.k_froz_omega_froz;

        aijx_term   "2.0"; // 2.0 ON and 1.0 OFF
        Rterm_corr  "1.0";
    }

// ************************************************************************* //

