04_Simulation/1.FROZEN/SST_MediumBody_with.inlet.dat.profile.interpolated_GEP_Tr.R.BFS.region.a5.k_froz_omega_froz_no-limiters_/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                       none;
    div(phi,U)                    bounded Gauss linearUpwindV grad(U);
    div(phi,k)                    bounded Gauss linearUpwind grad(k); //bounded Gauss limitedLinear 1;      // bounded Gauss linearUpwind grad(k);     // bounded Gauss upwind; 
    div(phi,omega)                bounded Gauss linearUpwind grad(omega); //bounded Gauss limitedLinear 1;      // bounded Gauss linearUpwind grad(omega); // bounded Gauss upwind; 
    div((nuEff*dev(T(grad(U)))))  Gauss linear;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(nonlinearStress)          Gauss linear;
    div(phi,epsilon)              bounded Gauss linearUpwind grad(epsilon);
    div(phi,R)                    bounded Gauss linearUpwind grad(R);
    div(R)                        Gauss linear;
    div(div(phi,U))               Gauss linear;
    div(dev(((2*k)*aijx)))        Gauss linear;
}

laplacianSchemes
{
//    default         Gauss linear limited 0.33;
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
//    default         limited corrected 0.33;
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
    Phi;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
